TobiasDecoud/Afinador-Guitarra-PsoC-5LP/ProyectoPDS/ProyectoPds_V1/ProyectoPDS solo matlab-20251102T203416Z-1-001/ProyectoPDS solo matlab/lab5-fiuna-filtros_sencillos/Design01.cydsn/codegentemp/CtrlReg_Filtro_Out.h
/*******************************************************************************
* File Name: CtrlReg_Filtro_Out.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_CtrlReg_Filtro_Out_H) /* CY_CONTROL_REG_CtrlReg_Filtro_Out_H */
#define CY_CONTROL_REG_CtrlReg_Filtro_Out_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} CtrlReg_Filtro_Out_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    CtrlReg_Filtro_Out_Write(uint8 control) ;
uint8   CtrlReg_Filtro_Out_Read(void) ;

void CtrlReg_Filtro_Out_SaveConfig(void) ;
void CtrlReg_Filtro_Out_RestoreConfig(void) ;
void CtrlReg_Filtro_Out_Sleep(void) ; 
void CtrlReg_Filtro_Out_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define CtrlReg_Filtro_Out_Control        (* (reg8 *) CtrlReg_Filtro_Out_Sync_ctrl_reg__CONTROL_REG )
#define CtrlReg_Filtro_Out_Control_PTR    (  (reg8 *) CtrlReg_Filtro_Out_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_CtrlReg_Filtro_Out_H */


/* [] END OF FILE */
